server/src/Thread Group.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <stringProp name="TestPlan.comments">testing</stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="message" elementType="Argument">
            <stringProp name="Argument.name">message</stringProp>
            <stringProp name="Argument.value">)&amp;wz.G3]R&amp;if6Z-$jS;wV#LdKcZ9GW4nRh8NgLEMm,AVB2(4mXqH]1U1iRdnr2Eec/%+R]GG!@P$Q1E2$Vnh8?1hz3AnTY42R,Dd</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">20</intProp>
        <intProp name="ThreadGroup.ramp_time">15</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">2</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="SQLliteConnection">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">SQLliteConnection</stringProp>
          <stringProp name="dbUrl">jdbc:sqlite:/Users/mobasshiraakterurmi/Documents/Fall_24_GA/Web-design/my-experiment-(march20)/server/src/empirica.db?busy_timeout=5000</stringProp>
          <stringProp name="driver">org.sqlite.JDBC</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="poolMax">0</stringProp>
          <boolProp name="preinit">false</boolProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request">
          <stringProp name="dataSource">SQLliteConnection</stringProp>
          <stringProp name="query">UPDATE game
SET chat =
  CASE
    WHEN chat IS NULL OR chat = &apos;&apos; THEN 
      &apos;Text: Hello World, Sender: player1&apos;
    ELSE 
      chat || &apos;; &apos; || &apos;Text: Hello World, Sender: player1&apos;
  END
WHERE id = &apos;game_1&apos;;
SELECT chat FROM game WHERE id=&apos;game_1&apos;;</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
          <stringProp name="variableNames">chat</stringProp>
        </JDBCSampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>